DmitriyKunitsin/STM32/ManchesterNew17.07/RUS_Regul/Firmware/Source/Src/RUS_Regul_Main.c
// RUS_Regul_Main.c
// Основной алгоритм работы плат регуляторов
#include "ProjectConfig.h"			// конфиг платформы
#include "stm32xxxx_hal.h"			// дрова периферии
#include "stm32l4xx_ll_tim.h"
#include "platform_common.h"
#include "common_gpio.h"
#include "common_rcc.h"				// DWT_TimerGet()
#include "RebootUtils.h"
#include "RUS_Regul_Common.h"
//#include "Logger.h"					// Logger_WriteRecord()
//#include "MathUtils.h"				// DIVIDE()
#include "Utils.h"					// CalcCRC16SKLP()
//#include "NVM.h"
//#include "eeprom_emul.h"
//#include <string.h>

// Отладочный вывод
#include "common_uart.h"			// HAL_UART_Ext_Transmit()
#include <stdio.h>					// snprintf()
#include "RUS_Regul_Events.h"
#include "DRIVER_Motor.h"
#include "RUS_Regul_Main.h"
#include "Driver_ADS1231.h"
#include "RUS_Regul_ADC.h"
//#include "SKLP_Interface_RUS_Regul.h"

static void WatchDog_TimerCallback( TimerHandle_t xTimer );
static void RUS_Regul_ServiceTimerCallback( TimerHandle_t xTimer );
static void RUS_Regul_StartDelayTimerCallback( TimerHandle_t xTimer );

static void RUS_Regul_MainTask (void *pParameters);

EventGroupHandle_t RUS_Regul_EventGroup;
TimerHandle_t WatchDog_xTimer;
RUS_Regul_t RUS_Regul;


#if defined(DEBUG_OUTPUT)
Debug_Output_t debug_output = {'S', 'T', 0};

static uint8_t ReadyCNT = 0;

static void Debug_Timer_Callback(TimerHandle_t pTimer)
{
	assert_param( NULL != RUS_Regul_EventGroup );
	xEventGroupSetBits( RUS_Regul_EventGroup, EVENTS_RUS_REGUL_DEBUG_OUTPUT );
}

void Debug_Timer_Start(void){
	TimerHandle_t DebugTimer = xTimerCreate("DebugTimer", pdMS_TO_TICKS(100.0f), pdTRUE, NULL, Debug_Timer_Callback);
	assert_param(NULL != DebugTimer);
	assert_param( pdPASS == xTimerStart(DebugTimer, 0) );
}

#endif

extern RTOS_Timers_t Timers;
extern Motor_Main_t Motor;

const RUS_Regul_Calibr_Press_t RUS_Regul_Press_CalibrDefault = { {0}, 0, 1, 0 };		// единичный калибровочный коэффициент по-умолчанию
const RUS_Regul_Calibr_Motor_t RUS_Regul_Motor_CalibrDefault = { {0}, 1, 100};			// 1 А потребления и 100% максимальная скорость по умолчанию

const NVM_Tag_t NVM_Tag_RUS_Regul_PressCalibr	= {	EEPROM_PRESS_CALIBR,	sizeof( Motor.Settings ),	&Motor.Settings,	&RUS_Regul_Press_CalibrDefault,		NULL,	NULL };
const NVM_Tag_t NVM_Tag_RUS_Regul_MotorCalibr	= {	EEPROM_MOTOR_CALIBR,	sizeof( Motor.Settings ),	&Motor.Settings,	&RUS_Regul_Motor_CalibrDefault,		NULL,	NULL };


void Motor_Press_Init(void)
{
	ADS1231_Init();
	assert_param( NVM_Result_Ok == NVM_TagLoad(&NVM_Tag_RUS_Regul_PressCalibr) );
	assert_param( NVM_Result_Ok == NVM_TagLoad(&NVM_Tag_RUS_Regul_MotorCalibr) );
}

bool RUS_Regul_TaskInit(void)
{
	assert_param(RUS_Regul_SKLP_InitCallbacks());
	assert_param(taskSCHEDULER_NOT_STARTED == xTaskGetSchedulerState());

	// Создать задачу
	TaskHandle_t RUS_Regul_MainTaskHandle;
	if( pdTRUE != xTaskCreate( RUS_Regul_MainTask, TASK_REGUL_MAIN_NAME, TASK_REGUL_MAIN_STACK_SIZE, NULL, TASK_REGUL_MAIN_PRIORITY, &RUS_Regul_MainTaskHandle ) )
		return false;
	if( NULL == RUS_Regul_MainTaskHandle )
		return false;

	// Инициализировать таймер RTOS, однократный таймер
	RUS_Regul.xStartDelayTimer = xTimerCreate( "REGUL_StartDelay", (TickType_t)( RUS_REGUL_STARTDELAY1_MS ), pdFALSE, NULL, RUS_Regul_StartDelayTimerCallback );
	assert_param( NULL != RUS_Regul.xStartDelayTimer );
	// Запустить таймер RTOS
	assert_param( pdFAIL != xTimerStart( RUS_Regul.xStartDelayTimer, 0 ) );

	// Инициализировать хендлер событий
	if( NULL == ( RUS_Regul_EventGroup = xEventGroupCreate( ) ) )
		return false;
	xEventGroupClearBits( RUS_Regul_EventGroup, EVENT_RUS_REGUL_EVENTS_ALL );
		
	return true;
	
}

void RUS_Regul_Motor_State_Get(void){
	RUS_Regul.SpeedSet = Motor.SpeedSet;
	RUS_Regul.SpeedMeas = Motor.SpeedMeas;
	RUS_Regul.AngleSet = Motor.AngleSet;
	RUS_Regul.CurPosition = RUS_Regul_Motor_Angle_Get();
	RUS_Regul.longCurPosition = RUS_Regul_Motor_Long_Angle_Get();
	RUS_Regul.TimerCNTValue = LL_TIM_GetCounter(SPEED_COUNTER_TIM);
	RUS_Regul.Press = Motor.Press;
	RUS_Regul.MotorPowerSupply = ADC_VSUP_Value_Get();
	RUS_Regul.MotorCurrent = ADC_OPAMP_Value_Get();
	RUS_Regul.CalibrNull = Motor.CalibrNull;
	RUS_Regul.MinAngle = Motor.MinAngle;
	RUS_Regul.MaxAngle = Motor.MaxAngle;
	RUS_Regul.MinPress = Motor.MinPress;
	RUS_Regul.MaxPress = Motor.MaxPress;
	RUS_Regul.WorkZone = Motor.WorkZone;
	RUS_Regul.WorkMode = Motor.WorkMode;
	RUS_Regul.WorkState = Motor.WorkState;
	RUS_Regul.ErrorFlag = Motor.ErrorFlag;
	RUS_Regul.LogicalFlag = Motor.LogicalFlag;
}

void RUS_Regul_Main_Struct_Update(void){
	RUS_Regul_Motor_State_Get();
}

void EX_RUS_Regul_Motor_Speed_Set(float speed_percent)
{
	Motor.WorkMode = Ready;
	if(speed_percent > 0){
		Motor_Rotation_Set(Clockwise);
		Motor_Speed_Set(speed_percent);
	}
	else if(speed_percent < 0){
		Motor_Rotation_Set(CounterClockWise);
		Motor_Speed_Set(-speed_percent);
	}
	else if(0 == speed_percent){
		RUS_Regul_Motor_Stop();
	}
}

void EX_RUS_Regul_Motor_Angle_Set(int16_t angle, float speed_percent)
{
	if(0 == angle)
	{
		Motor_Stop();
	}
	else if(angle > 0)
	{
		Motor_Rotation_Set(Clockwise);
		if( angle <= 30 ){
			speed_percent = 30;
			Motor_Angle_Set( angle, speed_percent);
		}
		else{
			Motor_Angle_Set(angle, speed_percent);
		}
	}
	else if(angle < 0)
	{
		Motor_Rotation_Set(CounterClockWise);
		if( (-angle) <= 30){
			speed_percent = 30;
			Motor_Angle_Set( (-angle), speed_percent);
		}
		else{
			Motor_Angle_Set( (-angle), speed_percent);
		}
	}	
		
}

// Функция выставления скорости мотора. Реализуется с спомощью выставления необходимой скважности ШИМ. 
int RUS_Regul_Motor_Speed_Set(float speed_percent)
{
	if( (Motor.WorkMode == HoldingPressure) || (Motor.WorkMode == CalibratingConsumption) )
	{
		Motor_Speed_Set(speed_percent);
	}
	else
	{
		if(speed_percent > 0){
			Motor_Rotation_Set(Clockwise);
			Motor_Speed_Set(speed_percent);
		}
		if(speed_percent < 0){
			Motor_Rotation_Set(CounterClockWise);	
			Motor_Speed_Set(-speed_percent);
		}
		if(speed_percent == 0){
			RUS_Regul_Motor_Stop();
		}
	}
	return(0);
}

void RUS_Regul_Motor_Stop(void){
	Motor_Stop();
}

void RUS_Regul_Absolute_Angle_Set(int16_t angle, float speed_percent)
{	
	if(angle == 0){
		RUS_Regul_Motor_Stop();
		if(Motor.fSetCalNullPos == 1){
			LL_TIM_SetCounter(SPEED_COUNTER_TIM, 0);
			Motor.fSetCalNullPos = 0;
			Motor.fCalibrStart = 0;
			Motor.fCalibrated = 1;
			Motor.WorkMode = Ready;
		}
	}
	
	else if(angle < 0)
	{
		Motor_Rotation_Set(CounterClockWise);
		if( (-angle) <= 30 )
		{
			speed_percent = 30.0f;
			Motor_Angle_Set( (-angle), speed_percent);
		}
		else
		{
			Motor_Angle_Set( (-angle), speed_percent);
		}
	}
	
	else if(angle > 0)
	{
		Motor_Rotation_Set(Clockwise);
		if(angle <= 30)
		{
			speed_percent = 30.0f;
			Motor_Angle_Set(angle, speed_percent);
		}
		else
		{
			Motor_Angle_Set(angle, speed_percent);
		}
	}

