DmitriyKunitsin/STM32/ManchesterNew17.07/RUS_Regul/Firmware/Source/Src/RUS_Regul_Main.c
}

float RUS_Regul_Motor_Angle_Get(void){

	static uint32_t curCount;
	static float curAngle;

	
	curCount = LL_TIM_GetCounter(SPEED_COUNTER_TIM);
	curAngle = (curCount % PULSE_PER_ONE_TURN) * (360.0f / PULSE_PER_ONE_TURN);
	
	Motor.CurPosition = curAngle;

	return(Motor.CurPosition);
}

float RUS_Regul_Motor_Long_Angle_Get(void){
	static uint32_t curCount;
	static float  longCurAngle;
	
	curCount = LL_TIM_GetCounter(SPEED_COUNTER_TIM);
	longCurAngle = curCount * 360.0f / PULSE_PER_ONE_TURN;
	
	Motor.longCurPosition = longCurAngle;

	return(Motor.longCurPosition);

}

void RUS_Regul_Motor_Calibration_Set(void)
{
	Motor_Rotation_Set(Clockwise);
	Motor_Calibration_Current_Start();
}

void RUS_Regul_Press_Calibration_Start(void)
{
	Motor_Calibration_Press_Start();
}

void RUS_Regul_Overlap_Set(int16_t percent)
{
	static int16_t prevAngle = 0;
	int16_t targetAngle = (Motor.WorkZone * percent / 100);
	int16_t angle;
	float speed;
	if(0 == Motor.fReverseLogic){
		if(targetAngle > prevAngle){
			Motor_Rotation_Set(Clockwise);
			angle = targetAngle - prevAngle;
			if((targetAngle - prevAngle) <= 30){
				speed = MIN_SPEED;
			}
			else{
				speed = MAX_SPEED;
			}
		}
		else if(targetAngle < prevAngle){
			Motor_Rotation_Set(CounterClockWise);
			angle = prevAngle - targetAngle;
			if((prevAngle - targetAngle) <= 30){
				speed = MIN_SPEED;
			}
			else{
				speed = MAX_SPEED;
			}
		}
		else if(targetAngle == prevAngle){
			angle = 0;
			speed = 0.0f;
		}
	}
	else{
		if(targetAngle > prevAngle){
			Motor_Rotation_Set(CounterClockWise);
			angle = targetAngle - prevAngle;
			if((targetAngle - prevAngle) <= 30){
				speed = MIN_SPEED;			
			}
			else{
				speed = MAX_SPEED;
			}
		}
		else if(targetAngle < prevAngle){
			Motor_Rotation_Set(Clockwise);
			angle = prevAngle - targetAngle;
			if( (prevAngle - targetAngle) <= 30 ){
				speed = MIN_SPEED;
			}
			else{
				speed = MAX_SPEED;
			}
		}
		else if(targetAngle == prevAngle){
			angle = 0;
			speed = 0.0f;
		}
	}

	prevAngle = targetAngle;
	Motor_Angle_Set(angle, speed);
}
	

// Существование этой функции пока под вопросом
void RUS_Regul_Motor_Toggle_Rotation(void){
	if(Motor.Rotation == Clockwise){
		Motor_Rotation_Set(CounterClockWise);
	}
	else if(Motor.Rotation == CounterClockWise){
		Motor_Rotation_Set(Clockwise);
	}
}

static void RUS_Regul_MainTask (void *pParameters)
{
	RUS_Regul_ADC_Init();
	RUS_Regul_ADC_Start();
	Motor_SpeedCounter_Init();
	Motor_CreateSpeedTimerTask();
	Motor_Press_Init();
	//Debug_Timer_Start();
	//Motor_SpeedControl_Init();
	
	
	RUS_Regul_ADC_AI_t adc_struct = {0};
	static float PressMedianFiltred[PRESS_MEDIAN_SIZE];

	
	// Основной цикл
	while( 1 )
	{         
		RUS_Regul_Main_Struct_Update();
	
		// Ожидание событий
		EventBits_t EventBitsWait = ( EVENT_RUS_REGUL_EVENTS_ALL );
		EventBits_t EventBits = EventBitsWait & xEventGroupWaitBits( RUS_Regul_EventGroup, EventBitsWait, true, false, portMAX_DELAY );

		//if(EVENTS_RUS_REGUL_DEBUG_OUTPUT & EventBits ){
		//	HAL_UART_Ext_Transmit(&COM1_UART_Ext_hdl, (uint8_t*)&debug_output, sizeof(debug_output), 100);
		//}

		if( EVENTS_RUS_REGUL_CURRENT_CHECK & EventBits )
		{
			if(ADC_OPAMP_Value_Get() >= CURRENT_LIMITER_VALUE){
				Motor.fStuck = 1;
				RUS_Regul_Motor_Stop();
			}

#if 0
			static int OverCurrentCount = 0;
			static float OverPosition = 0.0f;
			
			do{
				if(ADC_OPAMP_Value_Get() > CURRENT_LIMITER_VALUE){
					Motor.fStuck = 1;											// Выставить флаг, что застрял
					Motor.WorkMode = DiscoverOverCurrent; 						// Выставить режим работы отработки превышения тока потребления
					// Если были запущены какие-либо таймеры, остановить их
					OverPosition = RUS_Regul_Motor_Long_Angle_Get();
					if( xTimerIsTimerActive(Motor.Timers.CalibrPressTimer))
						xTimerStop(Motor.Timers.CalibrPressTimer, 0);
					if( xTimerIsTimerActive(Motor.Timers.CalibrTimer))
						xTimerStop(Motor.Timers.CalibrTimer, 0);
					if( xTimerIsTimerActive(Motor.Timers.StabPressTimer))
						xTimerStop(Motor.Timers.StabPressTimer, 0);

					// Счетчик попыток "выбить" застрявший предмет, который не дает вращаться и вызывает повышенное потребление
					OverCurrentCount++;			

					// Повернуться в другом направлении на 30 градусов с минимальной скоростью
					RUS_Regul_Motor_Toggle_Rotation();
					Motor_Angle_Set(30, MIN_SPEED);

					if( (OverCurrentCount > 2) && (OverCurrentCount <= 4) )
					{
						RUS_Regul_Motor_Toggle_Rotation();
						Motor_Angle_Set(365, MAX_SPEED);
					}
					
					if(OverCurrentCount > 4) // Если счетчик попыток превысил 4, сбросить питание с мотора,  
					{
						RUS_Regul_Motor_Stop();
						GPIO_Common_Write(iGPIO_MOTOR_PWR, GPIO_PIN_RESET);
						OverCurrentCount = 0;
						break;
					}
					
				}
				else{
					if(0 == Motor.fStuck){
						break;
					}
					else{
						Motor.fStuck = 0;
						//Motor.WorkMode = Ready;
					}
					break;
				}
			}while(0);
#endif
			
		}

		if ( EVENTS_RUS_REGUL_ADC1_FIRSTHALFBUFFER_READY & EventBits )		// Готовность первой половины буфера чтения данных с ADS1231
		{
			// Вычислить постоЯнные составлЯющие сигналов АЦП1 по первой половине буфера
			ADC1_AllChAvgHalfBuffer( true );
		}
		if ( EVENTS_RUS_REGUL_ADC1_SECONDHALFBUFFER_READY & EventBits )		// Готовность второй половины буфера чтения данных с ADS1231
		{
			// Вычислить постоЯнные составлЯющие сигналов АЦП1 по второй половине буфера
			ADC1_AllChAvgHalfBuffer( false );
			RUS_Regul_ADC_GetVoltages(&adc_struct);
		}
		if ( EVENTS_RUS_REGUL_TIMER_SPEED_COUNT_X_READY & EventBits )		// Вычислить скорость за X мс
		{
			float CurrentSpeed;
			static uint32_t curCount, prevCount, delta;
			prevCount = curCount;
			curCount = LL_TIM_GetCounter(SPEED_COUNTER_TIM);

			if(curCount > prevCount){
				delta = curCount - prevCount;
			}
			else if(curCount < prevCount){
				delta = prevCount - curCount;
			}
			else{
				delta = 0;
			}
			CurrentSpeed = (delta / (float)(PULSE_PER_ONE_ROUND_INTERNAL) / (float)(SPEED_COUNTER_TIMER_MS) * 1000.0f * 60.0f) / (float)(GEAR_RATIO);  // Скорость вала редуктора в минуту. 
			Motor.SpeedMeas = CurrentSpeed;

