DmitriyKunitsin/STM32/ManchesterNew17.07/RUS_Regul/Firmware/Source/Src/RUS_Regul_Main.c
		}
		if ( EVENTS_RUS_REGUL_TIMER_SPEED_COUNT_Y_READY & EventBits )		// Вычислить скорость за Y мс
		{
			
		}
		if ( EVENTS_RUS_REGUL_TIMER_SPEED_COUNT_Z_READY & EventBits )		// Вычислить скорость за Z мс
		{
			
		}
		if ( EVENTS_RUS_REGUL_SERVICETIMER & EventBits )		// 
		{
			
		}
		if ( EVENTS_RUS_REGUL_START_DELAY & EventBits )		// 
		{

		}
		if ( EVENTS_RUS_REGUL_STATE_TELE & EventBits )		// 
		{
			
		}
		if ( EVENTS_RUS_REGUL_MOTOR_POWER_ON & EventBits )		// Подать питание на мотор
		{
			
		}
		if ( EVENTS_RUS_REGUL_PROCESS_CALLBACK & EventBits )		// Готовность сдлеать действие при CNT = CCR1
		{
			switch(Motor.WorkMode)
			{
				case(Ready): // В состоянии готовности выполнения команд при попадании в колбек - ниего не делать. Регистр CCR1 игнорируется.
					//ReadyCNT++;
					//debug_output.ReadyCount = ReadyCNT;
					break;

				case(HoldingPressure):
					break;
				
				case(CalibratingConsumption):
					if(0 == Motor.fCalibrated){
						break;
					}
					if(1 == Motor.fCalibrated){
						RUS_Regul_Motor_Stop();
						Motor.AngleSet = 0;
					}
					break;
					
				case(CalibratingPress):
					// В начале калибровки CNT сбрасывается в ноль, а затем выставляется WorkMode, из-за чего CNT становится равным CCR1 и попадаем в перывание
					// (обработка прерывания здесь). Сначала выставить CCR1, а потом сбросить CNT в 0 нельзя, потому что CCR1 выставляется от текущего положения.
					// Если игнорировать ситуацию CCR1 = CNT = 0 все работает корректно.
					if(LL_TIM_GetCounter(SPEED_COUNTER_TIM) == 0) 
					{
						break;
					}
					if(Motor.SpeedSet == 30)
					{
						RUS_Regul_Motor_Stop();
						if(Motor.fSetCalNullPos == 1)
						{
							Motor.fSetCalNullPos = 0;
							Motor.fCalibrStart = 0;
							Motor.fCalibrated = 1;
							Motor.AngleSet = 0;
							Motor.WorkMode = Ready;
						}
					}
					else
					{
						Motor.SpeedSet = 30;
						RUS_Regul_Motor_Speed_Set(30);
						LL_TIM_OC_SetCompareCH1(SPEED_COUNTER_TIM, (LL_TIM_GetCounter(SPEED_COUNTER_TIM) + 200));
					}
					break;
					
				case(RotatingByAngle): // В режиме поворота на угол, плавно сделать доворот. CCR1 выставляется в зависимости от направления вращения
					if(Motor.SpeedSet == 30){
						RUS_Regul_Motor_Stop();
						Motor.WorkMode = Ready;
						Motor.AngleSet = 0;
						Motor.SpeedSet = 0;
					}
					else{
						Motor.SpeedSet = 30;
						if(Motor.Rotation == Clockwise){
							LL_TIM_OC_SetCompareCH1(SPEED_COUNTER_TIM, (LL_TIM_GetCounter(SPEED_COUNTER_TIM) + 200));
							RUS_Regul_Motor_Speed_Set(30);
						}
						else{
							LL_TIM_OC_SetCompareCH1(SPEED_COUNTER_TIM, (LL_TIM_GetCounter(SPEED_COUNTER_TIM) - 200));
							RUS_Regul_Motor_Speed_Set(-30);
						}
					}
					break;
				case(DiscoverOverCurrent):
					break;
					// Пока не ясно, каким образом действовать в ситуации застревания

			}
		}
		
		if ( EVENTS_RUS_REGUL_ADS1231_READY & EventBits )		// Готовность внешнего АЦП отдать данные 
		{
			static int32_t ADSCode, i = 0;
			static uint8_t count = 0;
			static uint8_t Transmit_Buf[62];
			float PressBar = 0;
			int16_t SIPressBar;
			static float avgPress = 0;
			static float NewPress;

			static uint32_t milliseconds = 0;

			static uint8_t arr_count_LSB = 2;
			static uint8_t arr_count_MSB = 3;

			static uint8_t time_idx_0 = 4;
			static uint8_t time_idx_1 = 5;
			static uint8_t time_idx_2 = 6;
			static uint8_t time_idx_3 = 7;
			

			Transmit_Buf[0] = 0xFF;
			Transmit_Buf[1] = 0xFF;
			
			ADS1231_DataRead(&ADSCode);
			RUS_Regul.ADC_Code = ADSCode;
			PressBar = ADSCode * CONVERT_TO_BAR * ADS1231_CALIBR_COEF_A - ADS1231_CALIBR_COEF_B;
			#if defined(TEST_BOARD)
				PressBar = ((((((ADSCode * 0.5f * ADS1231_VDDA) / ADS1231_GAIN) / ADS1231_MAX_CODE) * ADS1231_V_TO_MV) / ADS1231_VDDA) * TEST_COEF_A - TEST_COEF_B);
				SIPressBar = (int16_t)(PressBar * 100);
				milliseconds = HAL_GetTick();
				#if defined(UART_DEBUG_LOG)	
				
					Transmit_Buf[arr_count_LSB] = (uint8_t)(SIPressBar>>8);
					Transmit_Buf[arr_count_MSB] = (uint8_t)(SIPressBar);

					Transmit_Buf[time_idx_0] = (uint8_t)(milliseconds>>24);					
					Transmit_Buf[time_idx_1] = (uint8_t)(milliseconds>>16);
					Transmit_Buf[time_idx_2] = (uint8_t)(milliseconds>>8);
					Transmit_Buf[time_idx_3] = (uint8_t)(milliseconds);

					
					if (time_idx_3 == 61){
						HAL_UART_Ext_Transmit(&COM1_UART_Ext_hdl, Transmit_Buf, sizeof(Transmit_Buf), 0);
						arr_count_LSB = 2;
						arr_count_MSB = 3;
						time_idx_0 = 4;
						time_idx_1 = 5;
						time_idx_2 = 6;
						time_idx_3 = 7;						
					}
					else 
					{
						arr_count_LSB += 6;
						arr_count_MSB += 6;
						time_idx_0 += 6;
						time_idx_1 += 6;
						time_idx_2 += 6;
						time_idx_3 += 6;
					}
				#endif
			#endif
			
			RUS_Regul.CurPress = PressBar;
			if( (i < PRESS_MEDIAN_SIZE) )
			{
				PressMedianFiltred[i++] = PressBar;
			}
			if( (i % PRESS_MEDIAN_SIZE) == 0)
			{			
            	heapsort_2(PressMedianFiltred, (uint16_t)(PRESS_MEDIAN_SIZE));

				if(1 == count){
					NewPress = PressMedianFiltred[PRESS_MEDIAN_HALF_SIZE];
					avgPress = (1 - BETA_COEF_FILTER) * avgPress + BETA_COEF_FILTER * NewPress;
				}

				if(0 == count){
					avgPress = PressMedianFiltred[PRESS_MEDIAN_HALF_SIZE];
					count = 1;
				}
				i = 0;
			}
			
			Motor.Press = avgPress;
			
		}

		if ( EVENTS_RUS_REGUL_CALIBR_OPAMP_START & EventBits )		// Начать процедуру поиска нулевого положения по потреблению
		{
			// Если был проинициализивроан процесс калибровки, сбросить флаги в исходное состояние
			Motor.fCalibrStart = 1;
			Motor.fCalibrated = 0;
			Motor.OPAMPThreshold = 0;
			Motor.MinAngle = 0;
			Motor.MaxAngle = 0;
			Motor.WorkZone = 0;
			Motor.fFoundLimit = 0;
			Motor.fCheckOPAMPValue = 1;
			RUS_Regul_Motor_Calibration_Set();
			LL_TIM_SetCounter(SPEED_COUNTER_TIM, 0);
		}		
		
		if (EVENTS_RUS_REGUL_OPAMP_VALUE_READY & EventBits)
		{
			if(Motor.fCalibrStart == 1)
			{		
				
				static uint16_t leftCount;
				static uint16_t rightCount;
				//CurCount = LL_TIM_GetCounter(SPEED_COUNTER_TIM);
				uint16_t workArea;
				
				float OpampValue = ADC_OPAMP_Value_Get();
				
				if(Motor.fCheckOPAMPValue == 1)
				{
					Motor.OPAMPThreshold = OpampValue * 1.3f;
					Motor.fCheckOPAMPValue = 0;
				}
							
				do
				{
					
					if( (OpampValue > Motor.OPAMPThreshold) && (Motor.fFoundLimit == 0) )
					{
						//rightCount = LL_TIM_GetCounter(SPEED_COUNTER_TIM);
						Motor.fFoundLimit = 1;
						Motor.MaxAngle = (LL_TIM_GetCounter(SPEED_COUNTER_TIM) % PULSE_PER_ONE_TURN) * (360.0f / PULSE_PER_ONE_TURN);
						Motor_Rotation_Set(CounterClockWise);
						break;
					}

