DmitriyKunitsin/STM32/ManchesterNew17.07/RUS_Regul/Firmware/Source/Src/RUS_Regul_Main.c
					if( (OpampValue > Motor.OPAMPThreshold) && (Motor.fFoundLimit == 1) )
					{
						RUS_Regul_Motor_Stop();
						//leftCount = LL_TIM_GetCounter(SPEED_COUNTER_TIM);
						
						Motor.fFoundLimit = 0; 
						Motor.fCalibrStart = 0;
						Motor.fCalibrated = 1;

						
						Motor.MinAngle = (LL_TIM_GetCounter(SPEED_COUNTER_TIM) % PULSE_PER_ONE_TURN) * (360.0f / PULSE_PER_ONE_TURN);
						
						Motor_Rotation_Set(Clockwise);

						if(Motor.MinAngle >= Motor.MaxAngle){
							Motor.MaxAngle += 360.0f;
						}
						//else if(Motor.MaxAngle > Motor.MinAngle){
						//	Motor.WorkZone = Motor.MaxAngle - Motor.MinAngle;
						//}

						//workArea = ((rightCount - leftCount) % PULSE_PER_ONE_TURN) * (360.0f / PULSE_PER_ONE_TURN);
						//Motor.WorkZone = workArea;

						Motor.WorkZone = Motor.MaxAngle - Motor.MinAngle;

						
						LL_TIM_SetCounter(SPEED_COUNTER_TIM, 0);
						xTimerStop(Motor.Timers.CalibrTimer , NULL);
						Motor.WorkMode = Ready;

						break;
					}

				} while(0);
			}
		}
		
		
		if( EVENTS_RUS_REGUL_CALIBR_PRESS_START & EventBits )		// Подготовить процесс калибровки по давлению
		{
			LL_TIM_SetCounter(SPEED_COUNTER_TIM, 0); // Перед каждой калибровкой принять текущее положение за 0	
			Motor.fReverseLogic = 0;
			Motor.fCalibrStart = 1;
			Motor.fCalibrated = 0;
			Motor.WorkZone = 0;
			Motor.MinAngle = 0;
			Motor.MaxAngle = 0;
			Motor.MinPress = 0;
			Motor.MaxPress = 0;
			RUS_Regul_Press_Calibration_Start();
			Motor.WorkMode = CalibratingPress;
		}

		if ( EVENTS_RUS_REGUL_CALIBR_PRESS_PROCESS & EventBits ) 	// Запустить процесс калибровки по давлению
		{

			static float CurAngle = 0;
			static float minAngle, maxAngle = 0; 
			static float minPress = 90000000;
			static float maxPress = -90000000;

			CurAngle = (LL_TIM_GetCounter(SPEED_COUNTER_TIM) % PULSE_PER_ONE_TURN) * (360.0f / PULSE_PER_ONE_TURN); 

			if(RUS_Regul.CurPress < minPress){
				minPress = RUS_Regul.CurPress;
				minAngle = CurAngle;
			}

			if(RUS_Regul.CurPress > maxPress){
				maxPress = RUS_Regul.CurPress;
				maxAngle = CurAngle;
			}

			if(Motor.WorkState == Standing){

				xTimerStop(Motor.Timers.CalibrPressTimer, NULL);
				
				Motor.MinAngle = minAngle;
				Motor.MaxAngle = maxAngle;

				Motor.MinPress = minPress;
				Motor.MaxPress = maxPress;
				if(maxAngle > minAngle){
					Motor.fReverseLogic = 0;
					Motor.WorkZone = maxAngle - minAngle;
				}
				else if(maxAngle < minAngle){
					Motor.fReverseLogic = 1;
					Motor.WorkZone = minAngle - maxAngle;
				}
				else if(minAngle == maxAngle){
					Motor.fBadCalibr = 1;
					Motor.CalibrNull = -100.0f;
				}
								
				Motor.CalibrNull = Motor.MinAngle; 				// Получен калибровочный ноль
				Motor.fSetCalNullPos = 1;						// Флаг выставления в положение минимума давления
				
				RUS_Regul_Absolute_Angle_Set(Motor.CalibrNull, MAX_SPEED); 
				minPress = 90000000;
				maxPress = -90000000;								
	
			}			
		} 	

		// Finish
		
		if( EVENTS_RUS_REGUL_HOLD_PRESS & EventBits )		// Запустить процесс стабилизации установленного давления
		{
			uint16_t TargetPress = RUS_Regul.PressSet;
			float CurrentPress = 0;
			CurrentPress = RUS_Regul.CurPress;
							
			do
			{
				if( (TargetPress <= Motor.MinPress) || (TargetPress >= Motor.MaxPress) )
				{
					break;
				}
				else
				{
					if(CurrentPress != TargetPress)
					{
						if(Motor.fReverseLogic == 0)
						{
							if(CurrentPress < TargetPress)
							{
								if(Motor.CurPosition >= Motor.MaxAngle)
								{
									RUS_Regul_Motor_Stop();
									break;
								}
								else
								{
									Motor_Rotation_Set(Clockwise);
									if( (TargetPress - CurrentPress) <= 2.0f ){
										RUS_Regul_Motor_Speed_Set(MIN_SPEED);
										break;
									}
									else if ( (TargetPress - CurrentPress) > 2.0f ){									
										RUS_Regul_Motor_Speed_Set(MAX_SPEED);
										break;
									}
									
									if( (CurrentPress >= (TargetPress - 0.5f)) && (CurrentPress <= (TargetPress + 0.5f)) )
									{
										RUS_Regul_Motor_Stop();
										break;
									}
								}
							}

							if(CurrentPress > TargetPress)
							{
								if(Motor.CurPosition <= Motor.MinAngle)
								{
									RUS_Regul_Motor_Stop();
									break;
								}
								else
								{
									Motor_Rotation_Set(CounterClockWise);
									if( (CurrentPress - TargetPress) <= 2.0f ){
										RUS_Regul_Motor_Speed_Set(MIN_SPEED);
										break;
									}
									else if( (CurrentPress - TargetPress) > 2.0f ){
										RUS_Regul_Motor_Speed_Set(MAX_SPEED);
										break;
									}			
									
									if( (CurrentPress >= (TargetPress - 0.5f)) && (CurrentPress <= (TargetPress + 0.5f)) )
									{
										RUS_Regul_Motor_Stop();
										break;
									}
								}
							}
						}



						if(Motor.fReverseLogic == 1)
						{
							if(CurrentPress < TargetPress)
							{
								if(Motor.CurPosition <= Motor.MaxAngle)
								{
									RUS_Regul_Motor_Stop();
									break;
								}
								else
								{
									Motor_Rotation_Set(CounterClockWise);
									if( (TargetPress - CurrentPress) <= 2.0f ){
										RUS_Regul_Motor_Speed_Set(MIN_SPEED);
										break;
									}
									else if ( (TargetPress - CurrentPress) > 2.0f ){									
										RUS_Regul_Motor_Speed_Set(MAX_SPEED);
										break;
									}

									if( (CurrentPress >= (TargetPress - 0.5f)) && (CurrentPress <= (TargetPress + 0.5f)) )
									{
										RUS_Regul_Motor_Stop();
										break;
									}
								}
							}


							if(CurrentPress > TargetPress)
							{
								if(Motor.CurPosition >= Motor.MinAngle)
								{
									RUS_Regul_Motor_Stop();
									break;
								}
								else
								{
									Motor_Rotation_Set(CounterClockWise);
									if( (CurrentPress - TargetPress) <= 2.0f ){
										RUS_Regul_Motor_Speed_Set(MIN_SPEED);
										break;
									}
									else if( (CurrentPress - TargetPress) > 2.0f ){
										RUS_Regul_Motor_Speed_Set(MAX_SPEED);
										break;
									}	


