DmitriyKunitsin/STM32/ManchesterNew17.07/RUS_Regul/Firmware/Source/Src/RUS_Regul_Main.c
									if( (CurrentPress >= (TargetPress - 0.5f)) && (CurrentPress <= (TargetPress + 0.5f)) )
									{
										RUS_Regul_Motor_Stop();
										break;
									}
								}
							}
						}
					}
					else
					{
						RUS_Regul_Motor_Stop();
						break;
						// Add answer like "Can't rotate more"
					}
				}
			}while(0);
		}
	}
}



// [1 с]	Коллбек таймера RTOS
// Периодический сброс WatchDog
static void WatchDog_TimerCallback( TimerHandle_t xTimer )
{
	assert_param( xTimer == WatchDog_xTimer );
	WatchdogReset( );
}


// [100 мс]	Коллбек таймера RTOS
/*static void RUS_Regul_ServiceTimerCallback( TimerHandle_t xTimer )
{
	assert_param( xTimer == RUS_Regul.xServiceTimer );

	// Выставить флаг готовности пакета данных к дальнейшей обработке
	assert_param( NULL != RUS_Regul_EventGroup );
	xEventGroupSetBits( RUS_Regul_EventGroup, EVENTS_RUS_REGUL_SERVICETIMER );
}*/
// [ мс]	Коллбек таймера RTOS
static void RUS_Regul_StartDelayTimerCallback( TimerHandle_t xTimer )
{
	assert_param( xTimer == RUS_Regul.xStartDelayTimer );

	// Выставить флаг готовности пакета данных к дальнейшей обработке
	assert_param( NULL != RUS_Regul_EventGroup );
	xEventGroupSetBits( RUS_Regul_EventGroup, EVENTS_RUS_REGUL_START_DELAY );
}

static void RUS_Regul_Check_Current_Timer_Callback(TimerHandle_t xTimer){
	assert_param( NULL != RUS_Regul_EventGroup );
	xEventGroupSetBits( RUS_Regul_EventGroup, EVENTS_RUS_REGUL_CURRENT_CHECK );
}


void RUS_Regul_OPAMP_Timer_Create(void){
	TimerHandle_t OPAMPTimer = xTimerCreate("OPAMPTimer", pdMS_TO_TICKS(OPAMP_TIMER_MS), pdTRUE, NULL,  RUS_Regul_Check_Current_Timer_Callback);
	assert_param(NULL != OPAMPTimer );
	assert_param( pdPASS == xTimerStart( OPAMPTimer, 0 ) );
	Motor.Timers.OPAMPTimer = OPAMPTimer;
}

void heapsort_2(float* arr, uint16_t N)  
{
	GPIO_Common_Write(iGPIO_ADDRESS_0, GPIO_PIN_SET);
    assert_param (arr != NULL);
    assert_param (N > 1);
    
    register uint16_t n = N, i = n/2, parent, child;  
    register float t;  
  
    for (;;) { /* Loops until arr is sorted */  
        if (i > 0) { /* First stage - Sorting the heap */  
            i--;           /* Save its index to i */  
            t = arr[i];    /* Save parent value to t */  
        } else {     /* Second stage - Extracting elements in-place */  
            n--;           /* Make the new heap smaller */  
            if (n == 0) return; /* When the heap is empty, we are done */  
            t = arr[n];    /* Save last value (it will be overwritten) */  
            arr[n] = arr[0]; /* Save largest value at the end of arr */  
        }  
  
        parent = i; /* We will start pushing down t from parent */  
        child = i*2 + 1; /* parent's left child */  
  
        /* Sift operation - pushing the value of t down the heap */  
        while (child < n) {  
            if (child + 1 < n  &&  arr[child + 1] > arr[child]) {  
                child++; /* Choose the largest child */  
            }  
            if (arr[child] > t) { /* If any child is bigger than the parent */  
                arr[parent] = arr[child]; /* Move the largest child up */  
                parent = child; /* Move parent pointer to this child */  
                //child = parent*2-1; /* Find the next child */  
                child = parent*2+1; /* the previous line is wrong*/  
            } else {  
                break; /* t's place is found */  
            }  
        }  
        arr[parent] = t; /* We save t in the heap */  
    }  
	GPIO_Common_Write(iGPIO_ADDRESS_0, GPIO_PIN_RESET);
}



